a = 1_000
b = 20

print(a + b)
print(a - b)
print(a * b)
print(a / b)

print(a // b)  # 计算商
print(a % b)   # 计算余数
print(3 ** 4)  # 次幂计算

#=======================================================================================
# 比较运算
print(a > b)
print(a < b)
print(a == b)
print(a != b)
print(a >= b)
print(a <= b)

#=======================================================================================
a = b   # 把b的值赋值给a
a += b  # 累加计算  相当于a = a + b
a -= b
a *= b
a /= b
a %= b
print(a)
print(b)

#=======================================================================================
# 逻辑运算 -> 布尔值
# and   并且. and左右两端同时为真. 结果才能是真. 有一个是假, 结局就是假
# or    或者. or左右两端, 有一个是真的, 那么结果就是真的.
# not   非,不.  非真既假, 非假既真

print(True and False)
print(True or False)
print(not False)

#=======================================================================================
# 练习
print(True or (False and True) or not False and True)
print(1 > 2 or 3 < 4 and 4 > 6)

#=======================================================================================
# 登录
username = input("请输入用户名:")
password = input("请输入密码:")
if username == 'admin' and password == "123456":
    print("登录成功")
else:
    print("登录失败")